{
  "title": "Other Classes",
  "description": "<p>Other classes (North Shore). Qui tem voluptat opta dolor resectorpor siminihitisi num reiust ute sum quia dio bearibusam illupta quae delende as conectiae moluptatus modit aperfero dem. Accaboreheni desequi non enim quis expel magnis volut volenimil ime num, qui quia quidit pore nus delit volor molori remossi odios sim qui aliquo ipsant, sequuntem.</p>",
  "classes": [
    {
      "title": "A Discovery Class in Computing",
      "level": "Introduction",
      "image": {
        "src": "../../images/classes/other-classes/1.jpg",
        "placeholder": ""
      },
      "min-age": 5,
      "max-age": 12,
      "description": "<p>The Discovery Course is a powerful educational experience for young learners who want to take their computing to the next level.</p><p>Students are put in charge of designing their ideal course with the guidance of our tutors. Each day may cover a different aspect of computing from a range of areas, including but not limited to:</p><ul><li>Mastering word processors such as Microsoft Word, taking advantage of little known features and hotkey shortcuts</li><li>Making animations using everyday applications such as Paint and PowerPoint</li><li>Basic programming</li><li>Creating 3D games</li><li>Understanding different web browsers, designing webpages and navigating the vast world of the Internet</li><li>Building your own computer</li><li>Graphing skills with Excel</li></ul></p>",
      "dates": [
        {
          "id": 319,
          "start-date": "2016-06-27",
          "end-date": "2016-07-01",
          "excludes": [],
          "cost": 370,
          "availability": "available"
        }
      ]
    },
    {
      "title": "Build Your Own Computer",
      "level": "Introduction",
      "image": {
        "src": "../../images/classes/other-classes/2.jpg",
        "placeholder": ""
      },
      "min-age": 7,
      "max-age": 12,
      "description": "<p>What are the advantages of building your own computer? This course provides an understanding of the principles of researching, assembling and maintaining a desktop computer. We supply all necessary components as learning resources.</p><p>Learn the terminology and purpose of each component of the computer. Compare and contrast different parts, manufacturing processes and their producers. Practice proper handling of parts in storage and installation.</p><p>You use our computers to disassemble and reassemble to install a motherboard, CPU, RAM, video cards and disk drives. You install the operating system and drivers.</p><p>We can show you where to buy computer equipment from with prices that may range from several hundred dollars to $1,500 or more for a top of the line desktop computer.</p>",
      "dates": [
        {
          "id": 320,
          "start-date": "2016-07-04",
          "end-date": "2016-07-08",
          "excludes": [],
          "cost": 370,
          "availability": "available"
        }
      ]
    }
  ]
}
